{
    "TenantName": "ASL-TO-CITTA",
    "TenantId": "E5ED27AA-7FEA-432F-91F4-42B9A9250908",
    "DestinationEventSource": "DocSuite Performance Agent",
    "PerformanceCounters": [
        {
            "Counter": {

                "CategoryName": "Processor",
                "CounterName": "% Processor Time",
                "InstanceName": "_TOTAL"
            },
            "Threshold": 90
        },
        {
            "Counter": {
                "CategoryName": "Memory",
                "CounterName": "% Committed Bytes In Use",
                "InstanceName": null
            },
            "Threshold": 80
        },
        {
            "Counter": {

                "CategoryName": "PhysicalDisk",
                "CounterName": "",
                "InstanceName": ""
            },
            "Threshold": 95
        }
    ]
}
/*
    For PhysicalDisk is not necessary to complete CounterName and InstanceName
    Parameters:
        CategoryName:
            The name of the performance counter category (performance object) with which this performance counter is associated.
            Available names:
                    - "Processor"
                    - "Memory"
                    - "Paging File"
                    - "PhysicalDisk"
                    - "Process"
                    - "System"
        CounterName:
            The name of the performance counter.
            Available names for:
                    - "Processor":
                        -> "% Processor Time": Determines the amount of processor utilization.
                        -> "% Privileged Time": The percentage of non-idle processor time spent in privileged mode.
                        -> "% Interrupt Time": The rate, in average number of interrupts in incidents per second, at which the processor received and serviced hardware interrupts.
                        -> "% DPC Time": The percentage of time that the processor spent receiving and servicing deferred procedure calls during the sample interval.
                    - "Memory":
                        -> "Available MBytes": This measures the amount of physical memory, in megabytes, available for running processes.
                        -> "Committed Bytes": It shows the amount of virtual memory, in bytes, that can be committed without having to extend the paging file(s).
                        -> "Commit Limit": 
                        -> "% Committed Bytes In Use": It shows the ratio of Memory\ Committed Bytes to the Memory\ Commit Limit.
                        -> "Pool Paged Bytes": It shows the size, in bytes, of the paged pool.
                        -> "Pool Nonpaged Bytes": It shows the size, in bytes, of the nonpaged pool.
                        -> "Cache Bytes": It shows the sum of the values of System Cache Resident Bytes, System Driver Resident Bytes, System Code Resident Bytes, and Pool Paged Resident Bytes.
                    - "PhysicalDisk":
                        -> "Disk Read Bytes/sec": It captures the total number of bytes sent to the disk and retrieved from the disk (read) during read operations.
                        -> "Disk Write Bytes/sec": It captures the total number of bytes sent to the write and retrieved from the disk (read) during write operations.
                        -> "Avg. Disk sec/Read": It captures the average time, in seconds, of a read of data from/to the disk.
                        -> "Avg. Disk sec/Write": It captures the average time, in seconds, of a write of data from/to the disk.
                        -> "% Disk Time": The percentage of elapsed time that the selected disk drive was busy servicing read or writes requests.
                    - "Process": 
                        -> "Thread Count": The number of threads created by the process.
                        -> "Handle Count": The value reports the number of handles that processes opened for objects they create.
                        -> "Thread Count": The value reports over time how many threads the processes create.
                    - "System": 
                        -> "Context Switches/sec": The counter increases when the thread gets or loses the time of the processor.
                        -> "System Calls/sec": This is the number of system calls being serviced by the CPU per second.
                        -> "Processor Queue Length": The counter is a rough indicator of the number of threads each processor is servicing.
                    - "Paging File":
                        -> "% Usage": Displays the percentage of the paging file that is currently in use.
        InstanceName:
            The name of the performance counter category instance, or an empty string (""), if the category contains a single instance.
            Available names for: 
                    - "Processor" -> "_Total"
                    - "Memory" -> null
                    - "PhysicalDisk" -> "_Total"
                    - "Process" -> "_Total"
                    - "System" -> null
                    - "Paging File" -> "_Total"
*/
